load_tests/tsung.xml
<?xml version="1.0"?>  
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="server_ip_here" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option name="ports_range" min="1025" max="65535"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="register-search-post" probability="50" type="ts_http">

      <!-- start out at the post feed -->
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <!-- go to the registration link -->
      <request>
        <http url='/users/sign_up' version='1.1' method='GET'></http>
      </request>

      <!-- wait while filling out the form -->
      <thinktime value="2" random="true"></thinktime>

      <!-- Create an account -->
      <request subst="true">
        <dyn_variable name="created_account_url" re="[Ll]ocation: (.*)\r"/>
        <http
          url='/users'
          version='1.1'
          method='POST'
          contents='utf8=%E2%9C%93&amp;user%5Bemail%5D=%%ts_user_server:get_unique_id%%%40test.com&amp;user%5Busername%5D=%%ts_user_server:get_unique_id%%&amp;user%5Bfirst_name%5D=%%ts_user_server:get_unique_id%%&amp;user%5Blast_name%5D=%%ts_user_server:get_unique_id%%&amp;user%5Bpassword%5D=Test123&amp;user%5Bpassword_confirmation%5D=Test123&amp;commit=Sign+up'>
        </http>
      </request>

      <!-- go to the posts feed -->
      <request>
        <http url='/posts' version='1.1' method='GET'></http>
      </request>

      <!-- filter posts in the feed (search for "e") -->
      <request subst="true">
        <http
          url='/posts'
          version='1.1'
          method='GET'
          contents='utf8=%E2%9C%93&amp;search_query%5D=e&amp;filterrific%5Btag_search_query%5D=python&amp;filterrific%5Bsorted_by%5D=cached_votes_score_desc&amp;commit=Filter'>
        </http>
      </request>

      <!-- generate random id for post -->
      <setdynvars sourcetype="random_number" start="1" end="60">
        <var name="random_post_id" />
      </setdynvars>

      <!-- view post -->
      <request subst="true">
        <http url='/posts/%%_random_post_id%%' version='1.1' method='GET'></http>
      </request>

      <!-- create a comment -->
      <request subst="true">
        <http
          url='/comments'
          version='1.1'
          method='POST'
          contents='utf8=%E2%9C%93&amp;comment%5Bcomment%5D=a&amp;comment%5Buser_id%5D=1&amp;comment%5Bpost_id%5D=%%_random_post_id%%&amp;commit=Create+Comment'>
        </http>
      </request>

      <!-- upvote the post -->
      <request subst="true">
        <http
          url='/posts/%%_random_post_id%%/like'
          version='1.1'
          method='POST'
          contents='_method=put'>
        </http>
      </request>

      <!-- go to post creation page -->
      <request>
        <http url='/posts/new' version='1.1' method='GET'></http>
      </request>

      <!-- wait while filling out a new post -->
      <thinktime value="2" random="true"></thinktime>

      <!-- create a post -->
      <request subst="true">
        <dyn_variable name="created_post_url" re="[Ll]ocation: (.*)\r"/>
        <dyn_variable name="created_post_id" re="[Ll]ocation: .*/posts/(.*)\r"/>
        <http
          url='/posts'
          version='1.1'
          method='POST'
          contents='utf8=%E2%9C%93&amp;post%5Bdescription%5D=This+is+a+post+description&amp;post%5Blanguage%5D=python&amp;post%5Bsnippit%5D=This+is+a+post+snippit&amp;post%5Ball_tags%5D=python%2C+post%2C+test&amp;commit=Create+Post'>
        </http>
      </request>

      <!-- go back to the post feed -->
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <!-- wait for comments -->
      <thinktime value="4" random="true"></thinktime>

      <!-- go back to created post -->
      <request subst="true">
        <http url='/posts/%%_created_post_id%%' version='1.1' method='GET'></http>
      </request>

      <!-- wait while viewing the comments -->
      <thinktime value="2" random="true"></thinktime>

      <!-- delete the post -->
      <request subst="true">
        <http
          url='/posts/%%_created_post_id%%'
          version='1.1'
          method='POST'
          contents='_method=delete'>
        </http>
      </request>

      <!-- go to the user's profile -->
      <request>
        <http url='/profile' version='1.1' method='GET'></http>
      </request>

      <!-- edit the user's profile -->
      <request>
        <http url='/edit' version='1.1' method='GET'></http>
      </request>

      <!-- delete the user's account -->
      <request subst="true">
        <http
          url='/users'
          version='1.1'
          method='POST'
          contents='_method=delete'>
        </http>
      </request>
    </session>
  </sessions>
</tsung>