load_tests/tsung.xml
<?xml version="1.0"?>  
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="server_ip_here" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="30" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option name="ports_range" min="1025" max="65535"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">

      <!-- start out at the post feed -->
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <!-- wait while viewing posts -->
      <thinktime value="2" random="true"></thinktime>

      <!-- go to the registration link -->
      <request>
        <http url='/users/sign_up' version='1.1' method='GET'></http>
      </request>

      <!-- wait while filling out the form -->
      <thinktime value="2" random="true"></thinktime>

      <!-- Use a random number for the user ID -->
      <setdynvars sourcetype="random_number" start="100"
      end="9999999">
        <var name="random_user_id" />
      </setdynvars>

      <!-- get authenticity token -->
      <request>
        <dyn_variable name="authenticity_token" ></dyn_variable> 
        <http url="/users/sign_up" version="1.1" method="GET"></http>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->
        {ok, Val} = ts_dynvars:lookup(authenticity_token, DynVars),
        list_to_binary(http_uri:encode(binary_to_list(Val)))
      end.">
        <var name="escaped_authenticity_token" />
      </setdynvars>

      <!-- Create an account -->
      <request subst="true">
        <dyn_variable name="created_account_url" re="[Ll]ocation: (.*)\r"/>
        <http
          url='/users'
          version='1.1'
          method='POST'
          contents='utf8=%E2%9C%93&amp;authenticity_token=%%_escaped_authenticity_token%%&amp;user%5Bemail%5D=%%_random_user_id%%%40test.com&amp;user%5Busername%5D=%%_random_user_id%%&amp;user%5Bfirst_name%5D=%%_random_user_id%%&amp;user%5Blast_name%5D=%%_random_user_id%%&amp;user%5Bpassword%5D=Test123&amp;user%5Bpassword_confirmation%5D=Test123&amp;commit=Sign+up'>
        </http>
      </request>

      <!-- go to post creation page -->
      <request>
        <http url='/posts/new' version='1.1' method='GET'></http>
      </request>

      <!-- wait while filling out a new post -->
      <thinktime value="2" random="true"></thinktime>

      <!-- get authenticity token -->
      <request>
        <dyn_variable name="authenticity_token" ></dyn_variable> 
        <http url="/posts/new" version="1.1" method="GET"></http>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->
        {ok, Val} = ts_dynvars:lookup(authenticity_token, DynVars),
        list_to_binary(http_uri:encode(binary_to_list(Val)))
      end.">
        <var name="escaped_authenticity_token" />
      </setdynvars>

      <!-- create a post -->
      <request subst="true">
        <dyn_variable name="created_post_url" re="[Ll]ocation: (.*)\r"/>
        <dyn_variable name="created_post_id" re="[Ll]ocation: .*/posts/(.*)\r"/>
        <http
          url='/posts'
          version='1.1'
          method='POST'
          contents='utf8=%E2%9C%93&amp;authenticity_token=%%_escaped_authenticity_token%%&amp;post%5Bdescription%5D=This+is+a+post+description&amp;post%5Blanguage%5D=python&amp;post%5Bsnippit%5D=This+is+a+post+snippit&amp;post%5Ball_tags%5D=python%2C+post%2C+test&amp;commit=Create+Post'>
        </http>
      </request>

      <!-- wait while viewing the post -->
      <thinktime value="2" random="true"></thinktime>

      <!-- get authenticity token -->
      <request subst="true">
        <dyn_variable name="authenticity_token" ></dyn_variable> 
        <http url="/posts/%%_created_post_id%%" version="1.1" method="GET"></http>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->
        {ok, Val} = ts_dynvars:lookup(authenticity_token, DynVars),
        list_to_binary(http_uri:encode(binary_to_list(Val)))
      end.">
        <var name="escaped_authenticity_token" />
      </setdynvars>

      <!-- create a comment -->
      <request subst="true">
        <http
          url='/comments'
          version='1.1'
          method='POST'
          contents='utf8=%E2%9C%93&amp;authenticity_token=%%_escaped_authenticity_token%%&amp;comment%5Bcomment%5D=a&amp;comment%5Buser_id%5D=1&amp;comment%5Bpost_id%5D=%%_created_post_id%%&amp;commit=Create+Comment'>
        </http>
      </request>

      <!-- wait while viewing the comments -->
      <thinktime value="2" random="true"></thinktime>

      <!-- get authenticity token -->
      <request subst="true">
        <dyn_variable name="authenticity_token" ></dyn_variable> 
        <http url="/posts/%%_created_post_id%%/edit" version="1.1" method="GET"></http>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->
        {ok, Val} = ts_dynvars:lookup(authenticity_token, DynVars),
        list_to_binary(http_uri:encode(binary_to_list(Val)))
      end.">
        <var name="escaped_authenticity_token" />
      </setdynvars>

      <!-- delete the post -->
      <request subst="true">
        <http
          url='/posts/%%_created_post_id%%'
          version='1.1'
          method='POST'
          contents='_method=delete&amp;authenticity_token=%%_escaped_authenticity_token%%'>
        </http>
      </request>

      <!-- wait while post is deleted -->
      <thinktime value="2" random="true"></thinktime>

      <!-- go to the posts feed -->
      <request>
        <http url='/posts' version='1.1' method='GET'></http>
      </request>

      <!-- wait while browsing posts -->
      <thinktime value="2" random="true"></thinktime>

      <!-- filter posts in the feed -->
      <request subst="true">
        <http
          url='/posts'
          version='1.1'
          method='GET'
          contents='utf8=%E2%9C%93&amp;search_query%5D=hello&amp;filterrific%5Btag_search_query%5D=python&amp;filterrific%5Bsorted_by%5D=cached_votes_score_desc&amp;commit=Filter'>
        </http>
      </request>

      <!-- wait while posts are filtered -->
      <thinktime value="2" random="true"></thinktime>

      <!-- go to the user's profile -->
      <request>
        <http url='/profile' version='1.1' method='GET'></http>
      </request>

      <!-- wait while viewing the profile -->
      <thinktime value="2" random="true"></thinktime>

      <!-- edit the user's profile -->
      <request>
        <http url='/edit' version='1.1' method='GET'></http>
      </request>

      <!-- wait while editing the profile -->
      <thinktime value="2" random="true"></thinktime>

      <!-- get authenticity token -->
      <request subst="true">
        <dyn_variable name="authenticity_token" ></dyn_variable> 
        <http url="/edit" version="1.1" method="GET"></http>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->
        {ok, Val} = ts_dynvars:lookup(authenticity_token, DynVars),
        list_to_binary(http_uri:encode(binary_to_list(Val)))
      end.">
        <var name="escaped_authenticity_token" />
      </setdynvars>

      <!-- delete the user's account -->
      <request subst="true">
        <http
          url='/users'
          version='1.1'
          method='POST'
          contents='_method=delete&amp;authenticity_token=%%_escaped_authenticity_token%%'>
        </http>
      </request>

      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
        io:format([126, $p, 126, $n, 126, $n], [DynVars]),
        ok end.">
        <var name="dump" />
      </setdynvars>
    </session>
  </sessions>
</tsung>